atarijookie/ce-atari/flash_stm32_2021/main.c
/*
  stm32flash - Open Source ST STM32 flash program for *nix
  Copyright 2010 Geoffrey McRae <geoff@spacevs.com>
  Copyright 2011 Steve Markgraf <steve@steve-m.de>
  Copyright 2012-2016 Tormod Volden <debian.tormod@gmail.com>
  Copyright 2013-2016 Antonio Borneo <borneo.antonio@gmail.com>

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
*/

#include <sys/types.h>
#include <sys/stat.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <signal.h>

#include "init.h"
#include "utils.h"
#include "serial.h"
#include "stm32.h"
#include "parsers/parser.h"
#include "port.h"

#include "parsers/binary.h"
#include "parsers/hex.h"

#include "gpio.h"

#if defined(__WIN32__) || defined(__CYGWIN__)
#include <windows.h>
#endif

#define VERSION "0.6_jookie"

/* device globals */
stm32_t     *stm        = NULL;
void        *p_st       = NULL;
parser_t    *parser     = NULL;
struct port_interface *port = NULL;

/* settings */
struct port_options port_opts = {
    .device         = NULL,
    .baudRate       = SERIAL_BAUD_57600,
    .serial_mode        = "8e1",
    .bus_addr       = 0,
    .rx_frame_max       = STM32_MAX_RX_FRAME,
    .tx_frame_max       = STM32_MAX_TX_FRAME,
};

enum actions {
    ACT_NONE,
    ACT_READ,
    ACT_WRITE,
    ACT_WRITE_UNPROTECT,
    ACT_READ_PROTECT,
    ACT_READ_UNPROTECT,
    ACT_ERASE_ONLY,
    ACT_CRC
};

enum actions    action      = ACT_NONE;
int     npages      = 0;
int             spage           = 0;
int             no_erase        = 0;
char        verify      = 0;
int     retry       = 10;
char        exec_flag   = 0;
uint32_t    execute     = 0;
char        init_flag   = 1;
int     use_stdinout    = 0;
char        force_binary    = 0;
FILE        *diag;
char        reset_flag  = 0;
char        *filename;
char        *gpio_seq   = NULL;
uint32_t    start_addr  = 0;
uint32_t    readwrite_len   = 0;

/* functions */
int  parse_options(int argc, char *argv[]);
void show_help(char *name);

bool flashHans, flashFranz;             // influenced by -x and -y

static const char *action2str(enum actions act)
{
    switch (act) {
        case ACT_READ:
            return "memory read";
        case ACT_WRITE:
            return "memory write";
        case ACT_WRITE_UNPROTECT:
            return "write unprotect";
        case ACT_READ_PROTECT:
            return "read protect";
        case ACT_READ_UNPROTECT:
            return "read unprotect";
        case ACT_ERASE_ONLY:
            return "flash erase";
        case ACT_CRC:
            return "memory crc";
        default:
            return "";
    };
}

static void err_multi_action(enum actions new)
{
    fprintf(stderr,
        "ERROR: Invalid options !\n"
        "\tCan't execute \"%s\" and \"%s\" at the same time.\n",
        action2str(action), action2str(new));
}

static int is_addr_in_ram(uint32_t addr)
{
    return addr >= stm->dev->ram_start && addr < stm->dev->ram_end;
}

static int is_addr_in_flash(uint32_t addr)
{
    return addr >= stm->dev->fl_start && addr < stm->dev->fl_end;
}

static int is_addr_in_opt_bytes(uint32_t addr)
{
    /* option bytes upper range is inclusive in our device table */
    return addr >= stm->dev->opt_start && addr <= stm->dev->opt_end;
}

static int is_addr_in_sysmem(uint32_t addr)
{
    return addr >= stm->dev->mem_start && addr < stm->dev->mem_end;
}

/* returns the page that contains address "addr" */
static int flash_addr_to_page_floor(uint32_t addr)
{
    int page;
    uint32_t *psize;

    if (!is_addr_in_flash(addr))
        return 0;

    page = 0;
    addr -= stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    while (addr >= psize[0]) {
        addr -= psize[0];
        page++;
        if (psize[1])
            psize++;
    }

    return page;
}

/* returns the first page whose start addr is >= "addr" */
int flash_addr_to_page_ceil(uint32_t addr)
{
    int page;
    uint32_t *psize;

    if (!(addr >= stm->dev->fl_start && addr <= stm->dev->fl_end))
        return 0;

    page = 0;
    addr -= stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    while (addr >= psize[0]) {
        addr -= psize[0];
        page++;
        if (psize[1])
            psize++;
    }

    return addr ? page + 1 : page;
}

/* returns the lower address of flash page "page" */
static uint32_t flash_page_to_addr(int page)
{
    int i;
    uint32_t addr, *psize;

    addr = stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    for (i = 0; i < page; i++) {
        addr += psize[0];
        if (psize[1])
            psize++;
    }

    return addr;
}


#if defined(__WIN32__) || defined(__CYGWIN__)
BOOL CtrlHandler( DWORD fdwCtrlType )
{
    fprintf(stderr, "\nCaught signal %lu\n",fdwCtrlType);
    if (p_st &&  parser ) parser->close(p_st);
    if (stm  ) stm32_close  (stm);
    if (port) port->close(port);
    exit(1);
}
#else
void sighandler(int s){
    fprintf(stderr, "\nCaught signal %d\n",s);
    if (p_st &&  parser ) parser->close(p_st);
    if (stm  ) stm32_close  (stm);
    if (port) port->close(port);
    exit(1);
}
#endif

int main(int argc, char* argv[]) {
    int ret = 1;
    stm32_err_t s_err;
    parser_err_t perr;
    diag = stdout;

    fprintf(stderr, "\n");
    fprintf(stderr, "stm32flash " VERSION "\n");
    fprintf(stderr, "http://stm32flash.sourceforge.net/\n");
    fprintf(stderr, " - with the fix for DS1818\n");
    fprintf(stderr, " - with H730 support\n\n");

    if(!gpio_open()) {                          // open RPi GPIO
        return 0;
    }

    if (parse_options(argc, argv) != 0) {
        gpio_close();
        goto close;
    }

