atarijookie/ce-atari/flash_stm32_2021/main.c
    if(!flashHans && !flashFranz) {             // user didn't specify if he wants to flash Franz or Hanz?
        fprintf(stderr, "You didn't specify if you want to flash Hans (-x) or Franz (-y).\n");
        gpio_close();
        return 0;
    }

    if(flashHans) {                                             // show that flashing Hans
        fprintf(stderr, ">>> Will flash HANS <<<\n\n");
    } else {                                                    // show that flashing Franz
        fprintf(stderr, ">>> Will flash FRANZ <<<\n\n");
    }

    //----------------------------
    // this was added for CosmosEx
    // select the right STM32 chip
    bcm2835_gpio_write(PIN_RESET_HANS,          LOW);       // both Hans and Frans to RESET state
    bcm2835_gpio_write(PIN_RESET_FRANZ,         LOW);

    bcm2835_gpio_write(PIN_BOOT0_FRANZ_HANS,    HIGH);      // BOOT0: L means boot from flash, H means boot the boot loader

    // Now hold reset down until the serial port is open and setup,
    // because that will create some pulse on TX line which confuses the STM32 bootloader.
    //----------------------------

    if (action == ACT_READ && use_stdinout) {
        diag = stderr;
    }

#if defined(__WIN32__) || defined(__CYGWIN__)
    SetConsoleCtrlHandler( (PHANDLER_ROUTINE) CtrlHandler, TRUE );
#else
    struct sigaction sigIntHandler;

    sigIntHandler.sa_handler = sighandler;
    sigemptyset(&sigIntHandler.sa_mask);
    sigIntHandler.sa_flags = 0;

    sigaction(SIGINT, &sigIntHandler, NULL);
#endif

    if (action == ACT_WRITE) {
        /* first try hex */
        if (!force_binary) {
            parser = &PARSER_HEX;
            p_st = parser->init();
            if (!p_st) {
                fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                goto close;
            }
        }

        if (force_binary || (perr = parser->open(p_st, filename, 0)) != PARSER_ERR_OK) {
            if (force_binary || perr == PARSER_ERR_INVALID_FILE) {
                if (!force_binary) {
                    parser->close(p_st);
                    p_st = NULL;
                }

                /* now try binary */
                parser = &PARSER_BINARY;
                p_st = parser->init();
                if (!p_st) {
                    fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                    goto close;
                }
                perr = parser->open(p_st, filename, 0);
            }

            /* if still have an error, fail */
            if (perr != PARSER_ERR_OK) {
                fprintf(stderr, "%s ERROR: %s\n", parser->name, parser_errstr(perr));
                if (perr == PARSER_ERR_SYSTEM) perror(filename);
                goto close;
            }
        }

        fprintf(diag, "Using Parser : %s\n", parser->name);

        /* We may know from the file how much data there is */
        if (!use_stdinout && !readwrite_len)
            readwrite_len = parser->size(p_st);
    } else {
        parser = &PARSER_BINARY;
        p_st = parser->init();
        if (!p_st) {
            fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
            goto close;
        }
    }

    if (port_open(&port_opts, &port) != PORT_ERR_OK) {
        fprintf(stderr, "Failed to open port: %s\n", port_opts.device);
        goto close;
    }

    //---------------------------------------------------
    // this was added for CosmosEx
    usleep(10000);                                          // this will assure the RESET line down for at least 10 ms
    
    if(flashHans) {                                         // flash Hans?
        bcm2835_gpio_write(PIN_TX_SEL1N2,       LOW);       // TX_SEL1N2, HIGH means TX1, LOW means TX2; tx1 is TX FRANZ, tx2 is TX HANS
        bcm2835_gpio_write(PIN_RESET_HANS,      HIGH);      // put Hans into RUN state
    } else {                                                // flash Franz?
        bcm2835_gpio_write(PIN_TX_SEL1N2,       HIGH);      // TX_SEL1N2, HIGH means TX1, LOW means TX2; tx1 is TX FRANZ, tx2 is TX HANS
        bcm2835_gpio_write(PIN_RESET_FRANZ,     HIGH);      // put Franz into RUN state
    }

    usleep(260000);                                         // let the STM32 boot and run for 250 + 10 ms (because DS1818 might cause 250 ms RESET signal)
    //---------------------------------------------------   

    fprintf(diag, "Interface %s: %s\n", port->name, port->get_cfg_str(port));
    if (init_flag && init_bl_entry(port, gpio_seq)){
        ret = 1;
        fprintf(stderr, "Failed to send boot enter sequence\n");
        goto close;
    }

    port->flush(port);

    stm = stm32_init(port, init_flag);
    if (!stm)
        goto close;

    fprintf(diag, "Version      : 0x%02x\n", stm->bl_version);
    if (port->flags & PORT_GVR_ETX) {
        fprintf(diag, "Option 1     : 0x%02x\n", stm->option1);
        fprintf(diag, "Option 2     : 0x%02x\n", stm->option2);
    }
    fprintf(diag, "Device ID    : 0x%04x (%s)\n", stm->pid, stm->dev->name);
    fprintf(diag, "- RAM        : Up to %dKiB  (%db reserved by bootloader)\n", (stm->dev->ram_end - 0x20000000) / 1024, stm->dev->ram_start - 0x20000000);
    fprintf(diag, "- Flash      : Up to %dKiB (size first sector: %dx%d)\n", (stm->dev->fl_end - stm->dev->fl_start ) / 1024, stm->dev->fl_pps, stm->dev->fl_ps[0]);
    fprintf(diag, "- Option RAM : %db\n", stm->dev->opt_end - stm->dev->opt_start + 1);
    fprintf(diag, "- System RAM : %dKiB\n", (stm->dev->mem_end - stm->dev->mem_start) / 1024);

    uint8_t     buffer[256];
    uint32_t    addr, start, end;
    unsigned int    len;
    int     failed = 0;
    int     first_page, num_pages;

    /*
     * Cleanup addresses:
     *
     * Starting from options
     *  start_addr, readwrite_len, spage, npages
     * and using device memory size, compute
     *  start, end, first_page, num_pages
     */
    if (start_addr || readwrite_len) {
        if (start_addr == 0)
            /* default */
            start = stm->dev->fl_start;
        else if (start_addr == 1)
            /* if specified to be 0 by user */
            start = 0;
        else
            start = start_addr;

        if (is_addr_in_flash(start))
            end = stm->dev->fl_end;
        else {
            no_erase = 1;
            if (is_addr_in_ram(start))
                end = stm->dev->ram_end;
            else if (is_addr_in_opt_bytes(start))
                end = stm->dev->opt_end + 1;
            else if (is_addr_in_sysmem(start))
                end = stm->dev->mem_end;
            else {
                /* Unknown territory */
                if (readwrite_len)
                    end = start + readwrite_len;
                else
                    end = start + sizeof(uint32_t);
            }
        }

        if (readwrite_len && (end > start + readwrite_len))
            end = start + readwrite_len;

        first_page = flash_addr_to_page_floor(start);
        if (!first_page && end == stm->dev->fl_end)
            num_pages = STM32_MASS_ERASE;
        else
            num_pages = flash_addr_to_page_ceil(end) - first_page;
    } else if (!spage && !npages) {
        start = stm->dev->fl_start;
        end = stm->dev->fl_end;
        first_page = 0;
        num_pages = STM32_MASS_ERASE;
    } else {
        first_page = spage;
        start = flash_page_to_addr(first_page);
        if (start > stm->dev->fl_end) {
            fprintf(stderr, "Address range exceeds flash size.\n");
            goto close;
        }

