atarijookie/ce-atari/flash_stm32_2021/main.c
        }

        fprintf(diag,   "Done.\n");
        ret = 0;
        goto close;
    } else if (action == ACT_CRC) {
        uint32_t crc_val = 0;

        fprintf(diag, "CRC computation\n");

        s_err = stm32_crc_wrapper(stm, start, end - start, &crc_val);
        if (s_err != STM32_ERR_OK) {
            fprintf(stderr, "Failed to read CRC\n");
            goto close;
        }
        fprintf(diag, "CRC(0x%08x-0x%08x) = 0x%08x\n", start, end,
            crc_val);
        ret = 0;
        goto close;
    } else
        ret = 0;

close:
    //----------------------------
    // this was added for CosmosEx
    bcm2835_gpio_write(PIN_RESET_HANS,          LOW);       // both Hans and Frans to RESET state
    bcm2835_gpio_write(PIN_RESET_FRANZ,         LOW); 

    bcm2835_gpio_write(PIN_BOOT0_FRANZ_HANS,    LOW);       // BOOT0: L means boot from flash, H means boot the boot loader

    usleep(10000);                                          // 10 ms pause to let the RESET work

    bcm2835_gpio_write(PIN_RESET_HANS,          HIGH);      // both Hans and Frans to RUN state
    bcm2835_gpio_write(PIN_RESET_FRANZ,         HIGH); 
    
    gpio_close();
    //----------------------------

    if (stm && exec_flag && ret == 0) {
        if (execute == 0)
            execute = stm->dev->fl_start;

        fprintf(diag, "\nStarting execution at address 0x%08x... ", execute);
        fflush(diag);
        if (stm32_go(stm, execute) == STM32_ERR_OK) {
            reset_flag = 0;
            fprintf(diag, "done.\n");
        } else
            fprintf(diag, "failed.\n");
    }

    if (stm && reset_flag) {
        fprintf(diag, "\nResetting device... \n");
        fflush(diag);
        if (init_bl_exit(stm, port, gpio_seq)) {
            ret = 1;
            fprintf(diag, "Reset failed.\n");
        } else
            fprintf(diag, "Reset done.\n");
    } else if (port) {
        /* Always run exit sequence if present */
        if (gpio_seq && strchr(gpio_seq, ':'))
            ret = gpio_bl_exit(port, gpio_seq) || ret;
    }

    if (p_st  ) parser->close(p_st);
    if (stm   ) stm32_close  (stm);
    if (port)
        port->close(port);

    fprintf(diag, "\n");
    return ret;
}

int parse_options(int argc, char *argv[])
{
    int c;
    char *pLen;

    while ((c = getopt(argc, argv, "xya:b:m:r:w:e:vn:g:jkfcChuos:S:F:i:R")) != -1) {
        switch(c) {
            case 'x':       // flash Hans?
                flashHans   = true;
                flashFranz  = false;
                break;

            case 'y':       // flash Franz?
                flashHans   = false;
                flashFranz  = true;
                break;

            case 'a':
                port_opts.bus_addr = strtoul(optarg, NULL, 0);
                break;

            case 'b':
                port_opts.baudRate = serial_get_baud(strtoul(optarg, NULL, 0));
                if (port_opts.baudRate == SERIAL_BAUD_INVALID) {
                    serial_baud_t baudrate;
                    fprintf(stderr, "Invalid baud rate, valid options are:\n");
                    for (baudrate = SERIAL_BAUD_1200; baudrate != SERIAL_BAUD_INVALID; ++baudrate)
                        fprintf(stderr, " %d\n", serial_get_baud_int(baudrate));
                    return 1;
                }
                break;

            case 'm':
                if (strlen(optarg) != 3
                    || serial_get_bits(optarg) == SERIAL_BITS_INVALID
                    || serial_get_parity(optarg) == SERIAL_PARITY_INVALID
                    || serial_get_stopbit(optarg) == SERIAL_STOPBIT_INVALID) {
                    fprintf(stderr, "Invalid serial mode\n");
                    return 1;
                }
                port_opts.serial_mode = optarg;
                break;

            case 'r':
            case 'w':
                if (action != ACT_NONE) {
                    err_multi_action((c == 'r') ? ACT_READ : ACT_WRITE);
                    return 1;
                }
                action = (c == 'r') ? ACT_READ : ACT_WRITE;
                filename = optarg;
                if (filename[0] == '-' && filename[1] == '\0') {
                    use_stdinout = 1;
                    force_binary = 1;
                }
                break;
            case 'e':
                if (readwrite_len || start_addr) {
                    fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
                    return 1;
                }
                npages = strtoul(optarg, NULL, 0);
                if (npages > STM32_MAX_PAGES || npages < 0) {
                    fprintf(stderr, "ERROR: You need to specify a page count between 0 and 0xffff");
                    return 1;
                }
                if (!npages)
                    no_erase = 1;
                break;
            case 'u':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_WRITE_UNPROTECT);
                    return 1;
                }
                action = ACT_WRITE_UNPROTECT;
                break;

            case 'j':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_READ_PROTECT);
                    return 1;
                }
                action = ACT_READ_PROTECT;
                break;

            case 'k':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_READ_UNPROTECT);
                    return 1;
                }
                action = ACT_READ_UNPROTECT;
                break;

            case 'o':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_ERASE_ONLY);
                    return 1;
                }
                action = ACT_ERASE_ONLY;
                break;

            case 'v':
                verify = 1;
                break;

            case 'n':
                retry = strtoul(optarg, NULL, 0);
                break;

            case 'g':
                exec_flag = 1;
                execute   = strtoul(optarg, NULL, 0);
                if (execute % 4 != 0) {
                    fprintf(stderr, "ERROR: Execution address must be word-aligned\n");
                    return 1;
                }
                break;
            case 's':
                if (readwrite_len || start_addr) {
                    fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
                    return 1;
                }
                spage    = strtoul(optarg, NULL, 0);
                break;
            case 'S':
                if (spage || npages) {
                    fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
                    return 1;
                } else {
                    start_addr = strtoul(optarg, &pLen, 0);
                    if (start_addr % 4 != 0) {
                        fprintf(stderr, "ERROR: Start address must be word-aligned\n");
                        return 1;
                    }
                    /* we decode 0 as 1 (which is unaligned and thus invalid anyway)
                     * to flag that it was set by the user */
                    if (pLen != optarg && start_addr == 0)
                        start_addr = 1;
                    if (*pLen == ':') {
                        pLen++;
                        readwrite_len = strtoul(pLen, NULL, 0);
                        if (readwrite_len == 0) {
                            fprintf(stderr, "ERROR: Invalid options, can't specify zero length\n");
                            return 1;
                        }
                    }
                }
                break;
            case 'F':
                port_opts.rx_frame_max = strtoul(optarg, &pLen, 0);
                if (*pLen == ':') {
                    pLen++;
                    port_opts.tx_frame_max = strtoul(pLen, NULL, 0);
                }
                if (port_opts.rx_frame_max < 0
                    || port_opts.tx_frame_max < 0) {
                    fprintf(stderr, "ERROR: Invalid negative value for option -F\n");
                    return 1;
                }
                if (port_opts.rx_frame_max == 0)
                    port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
                if (port_opts.tx_frame_max == 0)
                    port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
                if (port_opts.rx_frame_max < 20
                    || port_opts.tx_frame_max < 6) {
                    fprintf(stderr, "ERROR: current code cannot work with small frames.\n");
                    fprintf(stderr, "min(RX) = 20, min(TX) = 6\n");
                    return 1;
                }
                if (port_opts.rx_frame_max > STM32_MAX_RX_FRAME) {
                    fprintf(stderr, "WARNING: Ignore RX length in option -F\n");
                    port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
                }
                if (port_opts.tx_frame_max > STM32_MAX_TX_FRAME) {
                    fprintf(stderr, "WARNING: Ignore TX length in option -F\n");
                    port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
                }
                break;
            case 'f':
                force_binary = 1;
                break;

