atarijookie/ce-atari/flash_stm32_2021/main.c
            case 'c':
                init_flag = 0;
                break;

            case 'h':
                show_help(argv[0]);
                exit(0);

            case 'i':
                gpio_seq = optarg;
                break;

            case 'R':
                reset_flag = 1;
                break;

            case 'C':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_CRC);
                    return 1;
                }
                action = ACT_CRC;
                break;
        }
    }

    for (c = optind; c < argc; ++c) {
        if (port_opts.device) {
            fprintf(stderr, "ERROR: Invalid parameter specified\n");
            show_help(argv[0]);
            return 1;
        }
        port_opts.device = argv[c];
    }

    if (port_opts.device == NULL) {
        fprintf(stderr, "ERROR: Device not specified\n");
        show_help(argv[0]);
        return 1;
    }

    if ((action != ACT_WRITE) && verify) {
        fprintf(stderr, "ERROR: Invalid usage, -v is only valid when writing\n");
        show_help(argv[0]);
        return 1;
    }

    return 0;
}

void show_help(char *name) {
    fprintf(stderr,
        "Usage: %s [-bvngfhc] [-[rw] filename] tty_device\n"
        "   -x flash Hans\n"
        "   -y flash Franz\n"
        "   -b rate     Baud rate (default 57600)\n"
        "   -m mode     Serial port mode (default 8e1)\n"
        "   -r filename Read flash to file (or - stdout)\n"
        "   -w filename Write flash from file (or - stdout)\n"
        "   -C      Compute CRC of flash content\n"
        "   -u      Disable the flash write-protection\n"
        "   -j      Enable the flash read-protection\n"
        "   -k      Disable the flash read-protection\n"
        "   -o      Erase only\n"
        "   -e n    Only erase n pages before writing the flash\n"
        "   -v      Verify writes\n"
        "   -n count    Retry failed writes up to count times (default 10)\n"
        "   -g address  Start execution at specified address (0 = flash start)\n"
        "   -S address[:length] Specify start address and optionally length for\n"
        "                       read/write/erase operations\n"
        "   -F RX_length[:TX_length]  Specify the max length of RX and TX frame\n"
        "   -s start_page   Flash at specified page (0 = flash start)\n"
        "   -f      Force binary parser\n"
        "   -h      Show this help\n"
        "   -c      Resume the connection (don't send initial INIT)\n"
        "           *Baud rate must be kept the same as the first init*\n"
        "           This is useful if the reset fails\n"
        "   -R      Reset device at exit.\n", name
    );
}

